import random

angleren = [

    ['Օսմանյան կայսրությունում ո՞ր ազգը\n ուներ ամենաքիչ ներկայացչությունը',
     ['հույներ', 'հրեաներ', 'հայեր', 'հնդիկներ '], 0, 3],

    ['Ո՞ր թվականին են կատարվել Է \n Էրզրումի ջարդերը', ['1920', '1914', '1895 ', '1870'], 1, 2],

    [' Արևմտահայության զանգվածային վե-\nրաբնակեցումը ռուսական տերությանն\nանցած տարածքներ սկսվել է`',
     ["1829թ", "1833թ", "1831թ ", "1830թ"], 2, 2],

    ['Սասունի հայ համայնքի կոտորածների\nընթացքում քանիսն էր սպանվածների թիվը', ['500', '3000 ', '300', '5000'], 3, 1],

    ['Ո՞ր երկիրը առաջինը ճանաչեց \n Հայոց Ցեղասպանություն', ['ԱՄՆ', 'Հունաստան', 'Ուրուգվայ ', 'Ֆրանսիա'], 4, 2],

    ['Ո՞ր թվականին է սկսվել\n Արցախյան առաջին պատերազմը', ['1988 ', '1980', '1999', '1985'], 5, 0],

    ['Ո՞ր թվականին է եղել Շուշիի ազատագրումը', ['1989', '1992 ', '1986', '1995'], 6, 1],

    ["Երբ է հիմնադրվել \nՎանի թագավարությունը", ['մթա 9-6-րդ դարեր', 'մ․թ․ա 5րդ դար', "Մ․Թ․Ա 6րդ դար ", "8րդ դար"], 7,
     2],

    ["Ով է Արտաշեսյանների\n տոհմի հիմնադիրը", ["Տիգրան Մեծ", "Արտավազդ II", "Արտաշես I ", "Տիգրան I"], 8, 2],

    ["Ե՞րբ է եղել \n Ավարայրի ճակատամարտը", ["491", "451 ", "780", "820"], 9, 1],

    ['Ե՞րբ է ստեղծվել \n Նոր Ջուղայի հայկական տպարանը',
     ["1618 թ", "1638 թ.", "1568 թ", "1616 թ."], 10, 1],

    ['Ո՞վ էր պարսկական բանակի առաջնորդը\n Ավարայրի ճակատամարտին',
     ['Դենշապուհ', 'Աթիլլա', 'Մ․ Նիսալավուրտ ', 'Շավասպ'], 11, 2],

    ['Ո՞վ էր առաջին հանրապետության \n առաջին վարչապետը',
     ['Ա.Խատիսյան', 'Ա․ Քաջազնունի ', 'Արամ Մանուկյան', 'Հ․ Հախվերդյան'], 12, 1],

    ['Ե՞րբ Վրաստանը գրավեց \n Ախալքալաքը և Լոռին', ['1918թ Սեպ․', '1919թ Մայիս', '1918թ Դեկ․ ', '1919թ Դեկ․'], 13, 2],

    ['Արաբները ո՞ր թվականին լուծեցին \nՎարդանակերտի պարտության վրեժը.', ['705թ․', '708թ', '725թ ', '703թ'], 14, 2],

    ['Ո՞րն է Հայկական լեռնաշխարհի\nկենտրոնում ձգվող լեռնաշղթան',
     ['Արցախի', 'Հայկական Պար ', 'Հայկան Տավրոս', 'Գեղամա'], 15, 1],

    ['Վասակը սպարապետը որտե՞ղ է վերաթաղել\n պարսիկներից ազատած հայ Արշակունի\n թագավորների աճյունները',
     ['Անիում', 'Անգեղում', 'Աղձքում ', 'Կուաշում'], 16, 2],

    ['Ո՞ր պատմիչն է վկայել, որ \nՏիգրանակերտում եղել է թատրոն',
     ["Պլուտարքոսը ", "Տակիտոսը", "Պոլիբիոսը", "Դիոն Կասիոսը"], 17, 0],

    ['Խալդյան դարպասը հետագայում\n ի՞նչ է կոչել ժողովուրդը',
     ['Մհերի դուռ ', 'Խալդիի դուռ', 'Մենուայի դուռ', 'Սրբազան մուտք'], 18, 0],

    ['Ով է սպանել\n Աղասի Խանջյանին.', ['Գ.Զինովև', 'Լ. Տրոցկի', 'Լ.Կամենև', 'Լ․Բերիա '], 19, 3],

    ['Ո՞վ է 1905թ Բաքվի ինքնապաշտպանու-\nթյունից հետո ղեկավարել Երևանի \nնահանգի ինքնապաշտպանությունը',
     ['Նիկոլ Դումանը', 'Քեռին', 'Վարդանը ', 'Արմեն Գարոն'], 20, 2],

    ["Քանի՞ սեպագիր արձանագրություն է\nպահպանվել Վանի թագավորությունից",
     ['մոտ 800 ', 'ավելի քան 1500', 'ավելի քան 1000', 'ավելի քան 2000'], 21, 0],

    ['Ո՞ր թվականին Կիրակոս Վիրապեցին\n ընտրվեց կաթողիկոս', ['1452թ', '1461թ', '1441թ ', '1440թ'], 22, 2],

    ['Հայ արքաներից ո՞վ է \n ամենաերկար թագավորածը', ['Հեթում Ա', 'Տիգրան Բ Մեծ', 'Ռուսա Բ ', 'Գագիկ Բագրատունի'], 23,
     2],

    ['Հայկական ո՞ր քաղաքն էր կոչվել\nՆերոնեա` ի պատիվ հռոմեացի կայսր\n Ներոնի',
     ['Արտաշատ ', 'Տիգրանակերտ', 'Դվին', 'Երվանդաշատ'], 24, 0],

    ['Միջնադարյան Եվրոպայի ո՞ր\n ճակատամարտին են մասնակցել հայերը',
     ['Սառցաջարդ', 'Գրյունվալդի ', 'Ազենկուրի', 'Բենևենտոյի'], 25, 1],

    ['Հայ ո՞ր թագավորն է\nեղել Մադրիդի տիրակալ', ['Թորոս Ա', 'Ռուբեն Գ', 'Հեթում Բ', 'Լևոն Զ '], 26, 3],

    ['Ի՞նչ էր հանճարեղ բյուզանդական հայ\nսպարապետի անունը, ով գրավել է Հռոմը',
     ['Բելիսարիոս', 'Նարսես ', 'Վիտալիանոս', 'Նիկեփորաս Փոկաս'], 27, 1],

    ['Ե՞րբ է ՀՀ-ն դարձել ԱՊՀ անդամ',
     ['1992թ մայիսի 21', '1991թ օգոստոսի 23', '1991թ դեկ. 8', '1991թ դեկ. 21 '], 28, 3],

    ['Որտե՞ղ է Տրդատ Մեծը դիմավորել\n Սուրբ Գրիգորին', ['Մաժակում', 'Աշտիշատում', 'Բագավանում ', 'Բագարանում'], 29, 2],

    ['Ներքոհիշյալ գործիչներից ո՞վ է\nապրել հելլենիզի ժամանակաշրջանում',
     ['Տ.Երվանդյանը', 'Դադարշիշը ', 'Գ.Դիմաքսյանը', 'Տիրիբազը'], 30, 1],

    ['ՀԱԵ-ի ներկայիս առաջնորդ Ամենայն\nՀայոց Գարեգին Բ կաթողիկոսը որերո՞րդ\n կաթողիկոսն է',
     ['135', '132 ', '130', '129'], 31, 1],

    ['Ե՞րբ է կնքվել «հավիտենական»\nհաշտության պայմանագիրը', ['527թ', '532թ ', '536թ', '591թ'], 32, 1],

    ['Ո՞ր գավառում է \nգտնվում Գուկանք գյուղը', ['Ռշտունիք', 'Վանանդ ', 'Շիրակ', 'Բագրևանդ'], 33, 1],

    ['Ո՞վ է հայ օպերային \nարվեստի հիմնադիրը', ['Ա. Տիգրանյանը', 'Գ. Սինանյանը', 'Մ. Եկմալյանը', 'Տ. Չուխաճյանը '], 34,
     3],

    ['Արամ անունով երկիրը \nհիշատակվում է դեռևս',
     ['Ք. ա. XIV դդ', 'Ք. ա. XXI դդ', 'Ք. ա. XII դդ ', 'Ք. ա. XXIII դդ'], 35, 2],

    ['Ի՞նչ լեզվով են գրված արտաշեսյան\n սահմանաքարերի արձանագրությունները',
     ['լատիներեն', 'արամերեն ', 'պարսկերեն', 'հայերեն'], 36, 1],

    ['Ե՞րբ են հայկական ուժերը\nադրբեջանցիներին Աղդամի մոտ պարտու-\nթյան մատնել',
     ['1994թ փետ․ 18', '1993թ. ապրիլի 23', '1993թ հոկ. 24', '1993թ. հուլ․ 23 '], 37, 3],

    ['Ե՞րբ են տեղի ունեցել\n Քարինտակի մարտերը',
     ['1991թ հունիսին', '1992թ փետրվարին', '1992թ հունվարին ', '1992թ մայիսին'], 38, 2],

    ['Ե՞րբ են Կ. Պոլսի ուսումնական խորհրդի\n անդամները մշակել արևմտահայերի ներքին\nկյանքին վերաբերող կանոնադրությունը',
     ['1857թ', '1863թ', '1862թ', '1860թ '], 39, 3],

    ['Ե՞րբ է ՀՀ-ն դարձել ԱՊՀ անդամ',
     ['1992թ մայիսի 21', '1991թ օգոստոսի 23', '1991թ դեկ. 8', '1991թ դեկ.21 '], 40, 3],
]

# for i in range(len(angleren)):
#     if len(angleren[i][0]) >= 72:
#         print(i + 1)
# print('---------------')
# for i in range(len(angleren)):
#     if len(angleren[i][1][0]) >= 15:
#         print(i + 1)
# for i in range(len(angleren)):
#     if len(angleren[i][1][1]) >= 15:
#         print(i + 1)
# for i in range(len(angleren)):
#     if len(angleren[i][1][2]) >= 15:
#         print(i + 1)
# for i in range(len(angleren)):
#     if len(angleren[i][1][3]) >= 15:
#         print(i + 1)
#

# ruseren = [
#
#     ['Какая нация имела наименьшее представительство в Османской империи',
#      ["Греки", "евреи", "армяне", "индейцы"], 0, 3],
#
#     ['В каком году была совершена резня в \nЭрзруме', ['1920', '1914', '1895', '1870'], 1, 2],
#
#     ['Началось массовое переселение армян из Армении - \n территорий, отошедших к Российской Империи \n:',
#      ["1829", "1833", "1831", "1830"], 2, 2],
#
#     ['Сколько было убито во время массовых убийств армянской общины Сасуна \n',
#      ['500', '3000', '300', '5000'], 3, 1],
#
#     ['Какая страна первой признала геноцид \nармян', ['США', 'Греция', 'Уругвай', 'Франция'], 4, 2],
#
#     ["В каком году началась первая арцахская война", ["1988", "1980", "1999", "1985"], 5, 0],
#
#     ["В каком году было освобождение Шуши", ["1989", "1992", "1986", "1995"], 6, 1],
#
#     ["Когда было основано королевство Ван", 2],
#
#     ["Кто является основателем династии Арташесянов",
#      ["Тигран Великий", "Артавазд II", "Арташес I", "Тигран I"], 8, 2],
#
#     ["Когда было Аварайрское сражение", ["491", "451", "780", "820"], 9, 1],
#
#     ['Кто правил армянской армией \nАварайрская битва',
#      ["Ваан Мамиконян", "Вардан Мамиконян", "Х.Дж. Вайоцдзор", "Жонд Ерец"], 10, 1],
#
#     ['Кто был лидером персидской армии в битве при Аварайре',
#      ['Деншапух', 'Атилла', 'М ․ Нисалавурт ', ' Шавасп '], 11, 2],
#
#     ['Кто был первым премьер-министром первой республики',
#      ['А.Хатисян', 'А. Каджазнуни ', ' Арам Манукян ', ' H ․ Ахвердян'], 12, 1],
#
#     ['Когда Грузия оккупировала \nАхалкалаки և Лори',
#      ['сентябрь 1918 года', ' май 1919 года ', ' декабрь 1918 года ․ ', '1919թ․'], 13, 2],
#
#     ['В каком году арабы отомстили за поражение Варданакерта', ['705 ․', '708', '725', '703'], 14, 2],
#
#     ['Что такое горный хребет в центре Армянского нагорья',
#      ["Арцах", "Армянский танец", "Айкан Таврос", "Гегама"], 15, 1],
#
#     ['Где Спарапет Васак перезахоронил тела армянских царей Аршакуна, \n освобожденных от персов',
#      ["Ин Ани", "Ангегум", "Агдзкум", "Куашум"], 16, 2],
#
#     ['Какой историк засвидетельствовал, что \nВ Тигранакерте был театр',
#      ["Плутарх", "Тацит", "Полибий", "Дион Кассий"], 17, 0],
#
#     ['Халдянские ворота позже \nкак их называли в народе',
#      ["Дверь Мгера", "Дверь Халди", "Дверь Менуа", "Священный вход"], 18, 0],
#
#     ['Кто убил \nАгаси Ханджяна', ['Г. Зинов և', 'Л. Троцкий', 'Л. Камень', 'Нагорный Карабах', 19, 3],
#
#      "Кто руководил самообороной Ереванской губернии после самообороны Баку 1905 года",
#      ["Николь Думан", "Дядя", "Вартан", "Армен Гарон"], 20, 2],
#
#     ["Сколько клинописных надписей сохранилось от Ванского королевства",
#      ["около 800", "более 1500", "более 1000", "более 2000"], 21, 0],
#
#     ['В каком году Киракос Вирапеци \n был избран католикосом', ['1452', '1461', '1441', '1440'], 22, 2],
#
#     ['Кто дольше всех правит армянских царей', ['Хетум I', 'Тигран II Великий', 'Руса II', 'Гагик Багратуни'],
#      23, 2],
#
#     ['Какой армянский город был назван \nНеронеей в честь римского императора \nНерона',
#      ["Арташат", "Тигранакерт", "Двин", "Ервандашат"], 24, 0],
#
#     ["В каком сражении в средневековой Европе принимали участие армяне",
#      ['Ледокол', 'Грюнвальд', 'Азенкури', 'Бененто'], 25, 1],
#
#     ['Какой армянский царь \ был правителем Мадрида', ['Торос I', 'Рубен III', 'Хетум II', 'Леон VI'], 26, 3],
#     ["Как звали гениального византийского армянского полководца, покорившего Рим",
#      ['Велисарий', 'Нарсес', 'Виталианос', 'Найпорас Покас'], 27, 1],
#
#     ["Когда Армения стала членом СНГ",
#      ['21 мая 1992 г.', '23 августа 1991 г.', 'декабрь 1991 г. 8 ', ' декабрь 1991 г. 21 '], 28, 3],
#
#     ['Где Трдат Великий встретил \nСвятого Григория', ['Мажакум', 'Аштишат', 'Багаван', 'Багаран'], 29, 2],
#
#     # (IV до н.э. - I век до н.э.)
#     ['Какие из следующих фигур \n жили в эллинистический период',
#      ['Т.Ервандян', 'Дадаршиш', 'Г. Димаксян', 'Тирибаз'], 30, 1],
#
#     ["Кто является нынешним лидером ААЦ, Католикос Всех Армян Гарегин II, Католикос",
#      ['135', '132', '130', '129'], 31, 1],
#
#     ["Когда был подписан вечный \n мирный договор", ['527', '532', '536', '591'], 32, 1],
#
#     ['В какой провинции находится деревня Гуканк', ["Рштуник", 'Вананд', 'Ширак', 'Багранданд'], 33, 1],
#
#     ['Кто является основоположником армянской оперы \ п', ['А. Тигранян', 'Г. Синанян', 'М. Екмалян', 'Т. Чухачян'], 34,
#      3],
#     # 121:
#     ['До сих пор упоминается страна по имени Арам \ n',
#      ['Ք. а. XIV вв ', ' Q. а. XXI век, К. а. XII вв ', ' Q. а. XXIII вв '], 35, 2],
#
#     ['На каком языке написаны протоколы к пограничным камням Арташеса \ n',
#      ['Латинский', 'арамейский', 'персидский', 'армянский'], 36, 1],
#
#     ['Когда армянские войска \ n победили азербайджанцев под Агдамом',
#      ['1994 фев ․ 18 ', ' 1993 23 апреля', ' 1993 г. 24 ', ' 1993 հուլ ․ 23 '], 37, 3],
#
#     ['Когда произошли битвы при Каринтаке?', ['Июнь 1991', 'Февраль 1992', 'Январь 1992', 'Май 1992'], 38, 2],
#     [
#         'Когда К. Члены Совета по образованию Константинополя \ nразрабатывают хартию, касающуюся внутренней жизни западных армян \ n ',
#         ['1857', '1863', '1862', '1860'], 39, 3],
#
#     ["Когда Армения стала членом СНГ", ['21 мая 1992 г.', '23 августа 1991 г.', 'декабрь 1991 г. 8 ', ' 1991 թ .21 '],
#      40, 3],
#
# ]
ruseren = [

    ['Օսմանյան կայսրությունում ո՞ր ազգը\n ուներ ամենաքիչ ներկայացչությունը',
     ['հույներ', 'հրեաներ', 'հայեր', 'հնդիկներ '], 0, 3],

    ['Ո՞ր թվականին են կատարվել Է \n Էրզրումի ջարդերը', ['1920', '1914', '1895 ', '1870'], 1, 2],

    ['Ե՞րբ է ստեղծվել Նոր Ջուղայի հայկական տպարանը',
     ['1618 թ', '1638 թ', '1568 թ', '1616 թ.'], 2, 2],

    ['Սասունի հայ համայնքի կոտորածների\nընթացքում քանիսն էր սպանվածների թիվը', ['500', '3000 ', '300', '5000'], 3, 1],

    ['Ո՞ր երկիրը առաջինը ճանաչեց \n Հայոց Ցեղասպանություն', ['ԱՄՆ', 'Հունաստան', 'Ուրուգվայ ', 'Ֆրանսիա'], 4, 2],

    ['Ո՞ր թվականին է սկսվել Արցախյան առաջին պատերազմը', ['1988 ', '1980', '1999', '1985'], 5, 0],

    ['Ո՞ր թվականին է եղել Շուշիի ազատագրումը', ['1989', '1992 ', '1986', '1995'], 6, 1],

    ["Երբ է հիմնադրվել \nՎանի թագավարությունը", ['մթա 9-6-րդ դարեր', 'մ․թ․ա 5րդ դար', "Մ․Թ․Ա 6րդ դար ", "8րդ դար"], 7,
     2],

    ["Ով է Արտաշեսյանների\n տոհմի հիմնադիրը", ["Տիգրան Մեծ", "Արտավազդ II", "Արտաշես I ", "Տիգրան I"], 8, 2],

    ["Ե՞րբ է եղել \n Ավարայրի ճակատամարտը", ["491", "451 ", "780", "820"], 9, 1],

    ['Ո՞վ էր կառավարում Հայոց բանակը \n Ավարայրի ճակատամարտին',
     ["Վահան Մամիկոնյան", 'Վարդան Մամիկոնյան ', 'Հ․Վայոցձորցին', 'Ղևոնդ Երեց'], 10, 1],

    ['Ո՞վ էր պարսկական բանակի առաջնորդը\n Ավարայրի ճակատամարտին',
     ['Դենշապուհ', 'Աթիլլա', 'Մ․ Նիսալավուրտ ', 'Շավասպ'], 11, 2],

    ['Ո՞վ էր առաջին հանրապետության \n առաջին վարչապետը',
     ['Ա.Խատիսյան', 'Ա․ Քաջազնունի ', 'Արամ Մանուկյան', 'Հ․ Հախվերդյան'], 12, 1],

    ['Ե՞րբ Վրաստանը գրավեց \n Ախալքալաքը և Լոռին', ['1918թ Սեպ․', '1919թ Մայիս', '1918թ Դեկ․ ', '1919թ Դեկ․'], 13, 2],

    ['Արաբները ո՞ր թվականին լուծեցին \nՎարդանակերտի պարտության վրեժը.', ['705թ․', '708թ', '725թ ', '703թ'], 14, 2],

    ['Ո՞րն է Հայկական լեռնաշխարհի\nկենտրոնում ձգվող լեռնաշղթան',
     ['Արցախի', 'Հայկական Պար ', 'Հայկան Տավրոս', 'Գեղամա'], 15, 1],

    ['Վասակը սպարապետը որտե՞ղ է վերաթաղել\n պարսիկներից ազատած հայ Արշակունի\n թագավորների աճյունները',
     ['Անիում', 'Անգեղում', 'Աղձքում ', 'Կուաշում'], 16, 2],

    ['Ո՞ր պատմիչն է վկայել, որ \nՏիգրանակերտում եղել է թատրոն',
     ["Պլուտարքոսը ", "Տակիտոսը", "Պոլիբիոսը", "Դիոն Կասիոսը"], 17, 0],

    ['Խալդյան դարպասը հետագայում\n ի՞նչ է կոչել ժողովուրդը',
     ['Մհերի դուռ ', 'Խալդիի դուռ', 'Մենուայի դուռ', 'Սրբազան մուտք'], 18, 0],

    ['Ով է սպանել\n Աղասի Խանջյանին.', ['Գ.Զինովև', 'Լ. Տրոցկի', 'Լ.Կամենև', 'Լ․Բերիա '], 19, 3],

    ['Ո՞վ է 1905թ Բաքվի ինքնապաշտպանու-\nթյունից հետո ղեկավարել Երևանի \nնահանգի ինքնապաշտպանությունը',
     ['Նիկոլ Դումանը', 'Քեռին', 'Վարդանը ', 'Արմեն Գարոն'], 20, 2],

    ["Քանի՞ սեպագիր արձանագրություն է\nպահպանվել Վանի թագավորությունից",
     ['մոտ 800 ', 'ավելի քան 1500', 'ավելի քան 1000', 'ավելի քան 2000'], 21, 0],

    ['Ո՞ր թվականին Կիրակոս Վիրապեցին\n ընտրվեց կաթողիկոս', ['1452թ', '1461թ', '1441թ ', '1440թ'], 22, 2],

    ['Հայ արքաներից ո՞վ է \n ամենաերկար թագավորածը', ['Հեթում Ա', 'Տիգրան Բ Մեծ', 'Ռուսա Բ ', 'Գագիկ Բագրատունի'], 23,
     2],

    ['Հայկական ո՞ր քաղաքն էր կոչվել\nՆերոնեա` ի պատիվ հռոմեացի կայսր\n Ներոնի',
     ['Արտաշատ ', 'Տիգրանակերտ', 'Դվին', 'Երվանդաշատ'], 24, 0],

    ['Միջնադարյան Եվրոպայի ո՞ր\n ճակատամարտին են մասնակցել հայերը',
     ['Սառցաջարդ', 'Գրյունվալդի ', 'Ազենկուրի', 'Բենևենտոյի'], 25, 1],

    ['Հայ ո՞ր թագավորն է\nեղել Մադրիդի տիրակալ', ['Թորոս Ա', 'Ռուբեն Գ', 'Հեթում Բ', 'Լևոն Զ '], 26, 3],

    ['Ի՞նչ էր հանճարեղ բյուզանդական հայ\nսպարապետի անունը, ով գրավել է Հռոմը',
     ['Բելիսարիոս', 'Նարսես ', 'Վիտալիանոս', 'Նիկեփորաս Փոկաս'], 27, 1],

    ['Ե՞րբ է ՀՀ-ն դարձել ԱՊՀ անդամ',
     ['1992թ մայիսի 21', '1991թ օգոստոսի 23', '1991թ դեկ. 8', '1991թ դեկ. 21 '], 28, 3],

    ['Որտե՞ղ է Տրդատ Մեծը դիմավորել\n Սուրբ Գրիգորին', ['Մաժակում', 'Աշտիշատում', 'Բագավանում ', 'Բագարանում'], 29, 2],

    ['Ներքոհիշյալ գործիչներից ո՞վ է\nապրել հելլենիզի ժամանակաշրջանում',
     ['Տ.Երվանդյանը', 'Դադարշիշը ', 'Գ.Դիմաքսյանը', 'Տիրիբազը'], 30, 1],

    ['ՀԱԵ-ի ներկայիս առաջնորդ Ամենայն\nՀայոց Գարեգին Բ կաթողիկոսը որերո՞րդ\n կաթողիկոսն է',
     ['135', '132 ', '130', '129'], 31, 1],

    ['Ե՞րբ է կնքվել «հավիտենական»\nհաշտության պայմանագիրը', ['527թ', '532թ ', '536թ', '591թ'], 32, 1],

    ['Ո՞ր գավառում է \nգտնվում Գուկանք գյուղը', ['Ռշտունիք', 'Վանանդ ', 'Շիրակ', 'Բագրևանդ'], 33, 1],

    ['Ո՞վ է հայ օպերային \nարվեստի հիմնադիրը', ['Ա. Տիգրանյանը', 'Գ. Սինանյանը', 'Մ. Եկմալյանը', 'Տ. Չուխաճյանը '], 34,
     3],

    ['Արամ անունով երկիրը \nհիշատակվում է դեռևս',
     ['Ք. ա. XIV դդ', 'Ք. ա. XXI դդ', 'Ք. ա. XII դդ ', 'Ք. ա. XXIII դդ'], 35, 2],

    ['Ի՞նչ լեզվով են գրված արտաշեսյան\n սահմանաքարերի արձանագրությունները',
     ['լատիներեն', 'արամերեն ', 'պարսկերեն', 'հայերեն'], 36, 1],

    ['Ե՞րբ են հայկական ուժերը\nադրբեջանցիներին Աղդամի մոտ պարտու-\nթյան մատնել',
     ['1994թ փետ․ 18', '1993թ. ապրիլի 23', '1993թ հոկ. 24', '1993թ. հուլ․ 23 '], 37, 3],

    ['Ե՞րբ են տեղի ունեցել\n Քարինտակի մարտերը',
     ['1991թ հունիսին', '1992թ փետրվարին', '1992թ հունվարին ', '1992թ մայիսին'], 38, 2],

    ['Ե՞րբ են Կ. Պոլսի ուսումնական խորհրդի\n անդամները մշակել արևմտահայերի ներքին\nկյանքին վերաբերող կանոնադրությունը',
     ['1857թ', '1863թ', '1862թ', '1860թ '], 39, 3],

    ['Ե՞րբ է ՀՀ-ն դարձել ԱՊՀ անդամ',
     ['1992թ մայիսի 21', '1991թ օգոստոսի 23', '1991թ դեկ. 8', '1991թ դեկ.21 '], 40, 3],
]

hayeren = [

    ['Օսմանյան կայսրությունում ո՞ր ազգը\n ուներ ամենաքիչ ներկայացչությունը',
     ['հույներ', 'հրեաներ', 'հայեր', 'հնդիկներ '], 0, 3],

    ['Ո՞ր թվականին են կատարվել Է \n Էրզրումի ջարդերը', ['1920', '1914', '1895 ', '1870'], 1, 2],

    [' Արևմտահայության զանգվածային վե-\nրաբնակեցումը ռուսական տերությանն\nանցած տարածքներ սկսվել է`',
     ["1829թ", "1833թ", "1831թ ", "1830թ"], 2, 2],

    ['Սասունի հայ համայնքի կոտորածների\nընթացքում քանիսն էր սպանվածների թիվը', ['500', '3000 ', '300', '5000'], 3, 1],

    ['Ո՞ր երկիրը առաջինը ճանաչեց \n Հայոց Ցեղասպանություն', ['ԱՄՆ', 'Հունաստան', 'Ուրուգվայ ', 'Ֆրանսիա'], 4, 2],

    ['Ո՞ր թվականին է սկսվել\n Արցախյան առաջին պատերազմը', ['1988 ', '1980', '1999', '1985'], 5, 0],

    ['Ո՞ր թվականին է\n եղել Շուշիի ազատագրումը', ['1989', '1992 ', '1986', '1995'], 6, 1],

    ["Երբ է հիմնադրվել \nՎանի թագավարությունը", ['մթա 9-6-րդ դարեր', 'մ․թ․ա 5րդ դար', "Մ․Թ․Ա 6րդ դար ", "8րդ դար"], 7,
     2],

    ["Ով է Արտաշեսյանների\n տոհմի հիմնադիրը", ["Տիգրան Մեծ", "Արտավազդ II", "Արտաշես I ", "Տիգրան I"], 8, 2],

    ["Ե՞րբ է եղել \n Ավարայրի ճակատամարտը", ["491", "451 ", "780", "820"], 9, 1],

    ['Ո՞վ էր կառավարում Հայոց բանակը \n Ավարայրի ճակատամարտին',
     ["Վահան Մ", 'Վարդան Մ․ ', 'Հ․Վայոցձորցին', 'Ղևոնդ Երեց'], 10, 1],

    ['Ո՞վ էր պարսկական բանակի առաջնորդը\n Ավարայրի ճակատամարտին',
     ['Դենշապուհ', 'Աթիլլա', 'Մ․ Նիսալավուրտ ', 'Շավասպ'], 11, 2],

    ['Ո՞վ էր առաջին հանրապետության \n առաջին վարչապետը',
     ['Ա.Խատիսյան', 'Ա․ Քաջազնունի ', 'Արամ Մանուկյան', 'Հ․ Հախվերդյան'], 12, 1],

    ['Ե՞րբ Վրաստանը գրավեց \n Ախալքալաքը և Լոռին', ['1918թ Սեպ․', '1919թ Մայիս', '1918թ Դեկ․ ', '1919թ Դեկ․'], 13, 2],

    ['Արաբները ո՞ր թվականին լուծեցին \nՎարդանակերտի պարտության վրեժը.', ['705թ․', '708թ', '725թ ', '703թ'], 14, 2],

    ['Ո՞րն է Հայկական լեռնաշխարհի\nկենտրոնում ձգվող լեռնաշղթան',
     ['Արցախի', 'Հայկական Պար ', 'Հայկան Տավրոս', 'Գեղամա'], 15, 1],

    ['Վասակը սպարապետը որտե՞ղ է վերաթաղել\n պարսիկներից ազատած հայ Արշակունի\n թագավորների աճյունները',
     ['Անիում', 'Անգեղում', 'Աղձքում ', 'Կուաշում'], 16, 2],

    ['Ո՞ր պատմիչն է վկայել, որ \nՏիգրանակերտում եղել է թատրոն',
     ["Պլուտարքոսը ", "Տակիտոսը", "Պոլիբիոսը", "Դիոն Կասիոսը"], 17, 0],

    ['Խալդյան դարպասը հետագայում\n ի՞նչ է կոչել ժողովուրդը',
     ['Մհերի դուռ ', 'Խալդիի դուռ', 'Մենուայի դուռ', 'Սրբազան մուտք'], 18, 0],

    ['Ով է սպանել\n Աղասի Խանջյանին.', ['Գ.Զինովև', 'Լ. Տրոցկի', 'Լ.Կամենև', 'Լ․Բերիա '], 19, 3],

    ['Ո՞վ է 1905թ Բաքվի ինքնապաշտպանու-\nթյունից հետո ղեկավարել Երևանի \nնահանգի ինքնապաշտպանությունը',
     ['Նիկոլ Դումանը', 'Քեռին', 'Վարդանը ', 'Արմեն Գարոն'], 20, 2],

    ["Քանի՞ սեպագիր արձանագրություն է\nպահպանվել Վանի թագավորությունից",
     ['մոտ 800 ', 'ավելի քան 1500', 'ավելի քան 1000', 'ավելի քան 2000'], 21, 0],

    ['Ո՞ր թվականին Կիրակոս Վիրապեցին\n ընտրվեց կաթողիկոս', ['1452թ', '1461թ', '1441թ ', '1440թ'], 22, 2],

    ['Հայ արքաներից ո՞վ է \n ամենաերկար թագավորածը', ['Հեթում Ա', 'Տիգրան Բ Մեծ', 'Ռուսա Բ ', 'Գագիկ Բագրատունի'], 23,
     2],

    ['Հայկական ո՞ր քաղաքն էր կոչվել\nՆերոնեա` ի պատիվ հռոմեացի կայսր\n Ներոնի',
     ['Արտաշատ ', 'Տիգրանակերտ', 'Դվին', 'Երվանդաշատ'], 24, 0],

    ['Միջնադարյան Եվրոպայի ո՞ր\n ճակատամարտին են մասնակցել հայերը',
     ['Սառցաջարդ', 'Գրյունվալդի ', 'Ազենկուրի', 'Բենևենտոյի'], 25, 1],

    ['Հայ ո՞ր թագավորն է\nեղել Մադրիդի տիրակալ', ['Թորոս Ա', 'Ռուբեն Գ', 'Հեթում Բ', 'Լևոն Զ '], 26, 3],

    ['Ի՞նչ էր հանճարեղ բյուզանդական հայ\nսպարապետի անունը, ով գրավել է Հռոմը',
     ['Բելիսարիոս', 'Նարսես ', 'Վիտալիանոս', 'Նիկեփորաս Փոկաս'], 27, 1],

    ['Ե՞րբ է ՀՀ-ն դարձել ԱՊՀ անդամ',
     ['1992թ մայիսի 21', '1991թ օգոստոսի 23', '1991թ դեկ. 8', '1991թ դեկ. 21 '], 28, 3],

    ['Որտե՞ղ է Տրդատ Մեծը դիմավորել\n Սուրբ Գրիգորին', ['Մաժակում', 'Աշտիշատում', 'Բագավանում ', 'Բագարանում'], 29, 2],

    ['Ներքոհիշյալ գործիչներից ո՞վ է\nապրել հելլենիզի ժամանակաշրջանում',
     ['Տ.Երվանդյանը', 'Դադարշիշը ', 'Գ.Դիմաքսյանը', 'Տիրիբազը'], 30, 1],

    ['ՀԱԵ-ի ներկայիս առաջնորդ Ամենայն\nՀայոց Գարեգին Բ կաթողիկոսը որերո՞րդ\n կաթողիկոսն է',
     ['135', '132 ', '130', '129'], 31, 1],

    ['Ե՞րբ է կնքվել «հավիտենական»\nհաշտության պայմանագիրը', ['527թ', '532թ ', '536թ', '591թ'], 32, 1],

    ['Ո՞ր գավառում է \nգտնվում Գուկանք գյուղը', ['Ռշտունիք', 'Վանանդ ', 'Շիրակ', 'Բագրևանդ'], 33, 1],

    ['Ո՞վ է հայ օպերային \nարվեստի հիմնադիրը', ['Ա. Տիգրանյանը', 'Գ. Սինանյանը', 'Մ. Եկմալյանը', 'Տ. Չուխաճյանը '], 34,
     3],

    ['Արամ անունով երկիրը \nհիշատակվում է դեռևս',
     ['Ք. ա. XIV դդ', 'Ք. ա. XXI դդ', 'Ք. ա. XII դդ ', 'Ք. ա. XXIII դդ'], 35, 2],

    ['Ի՞նչ լեզվով են գրված արտաշեսյան\n սահմանաքարերի արձանագրությունները',
     ['լատիներեն', 'արամերեն ', 'պարսկերեն', 'հայերեն'], 36, 1],

    ['Ե՞րբ են հայկական ուժերը\nադրբեջանցիներին Աղդամի մոտ պարտու-\nթյան մատնել',
     ['1994թ փետ․ 18', '1993թ. ապրիլի 23', '1993թ հոկ. 24', '1993թ. հուլ․ 23 '], 37, 3],

    ['Ե՞րբ են տեղի ունեցել\n Քարինտակի մարտերը',
     ['1991թ հունիսին', '1992թ փետրվարին', '1992թ հունվարին ', '1992թ մայիսին'], 38, 2],

    ['Ե՞րբ են Կ. Պոլսի ուսումնական խորհրդի\n անդամները մշակել արևմտահայերի ներքին\nկյանքին վերաբերող կանոնադրությունը',
     ['1857թ', '1863թ', '1862թ', '1860թ '], 39, 3],

    ['Ե՞րբ է ՀՀ-ն դարձել ԱՊՀ անդամ',
     ['1992թ մայիսի 21', '1991թ օգոստոսի 23', '1991թ դեկ. 8', '1991թ դեկ.21 '], 40, 3],
]

random.shuffle(angleren)
random.shuffle(ruseren)
random.shuffle(hayeren)

number_answer = dict()


def hh(lg):
    variant = angleren[0][0]

    if lg[-1] == 1:
        variant = ruseren[0][0]

    if lg[-1] == 2:
        variant = hayeren[0][0]

    return variant


def h1(lg):
    variant = angleren[0][1][0]

    if lg[-1] == 1:
        variant = ruseren[0][1][0]

    if lg[-1] == 2:
        variant = hayeren[0][1][0]

    return variant


def h2(lg):
    variant = angleren[0][1][1]

    if lg[-1] == 1:
        variant = ruseren[0][1][1]

    if lg[-1] == 2:
        variant = hayeren[0][1][1]

    return variant


def h3(lg):
    variant = angleren[0][1][2]

    if lg[-1] == 1:
        variant = ruseren[0][1][2]

    if lg[-1] == 2:
        variant = hayeren[0][1][2]

    return variant


asd = 0


def h4(lg):
    global number_answer, asd
    asd += 1
    variant = angleren[0][1][3]
    number_answer[angleren[0][2]] = angleren[0][3]
    if lg[-1] == 1:
        number_answer[ruseren[0][2]] = ruseren[0][3]
        variant = ruseren[0][1][3]

    if lg[-1] == 2:
        number_answer[hayeren[0][2]] = hayeren[0][3]
        variant = hayeren[0][1][3]

    del angleren[0]
    del ruseren[0]
    del hayeren[0]
    # if asd == 41:
    #     prc()
    # else:
    return variant

# def prc():
#     global number_answer
#     return number_answer
#
# for x in range(0, 7):
#     globals()[f"variable{x}"] = f"Hello the variable number {x}!"
# print(variable5)

# for i in range(40):
#     print(i)
#     print(hh([-1]))
#     print(h1([-1]))
#     print(h2([-1]))
#     print(h3([-1]))
#     print(h4([-1])